# BuiltInFailures.ElevationFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElevationFailures Class
BuiltInFailures Class Members See Also
---
Failures about Elevation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ElevationFailures
```

Visual Basic
---
```text
Public NotInheritable Class ElevationFailures
```

Visual C++
---
```text
public ref class ElevationFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ElevationFailures
# See Also
BuiltInFailures..::..ElevationFailures Members
Autodesk.Revit.DB Namespace